constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          30;
        startFace       47170;
    }
    wall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          800;
        startFace       47200;
    }
    axis
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          800;
        startFace       48000;
    }
    outlet
    {
        type            patch;
        nFaces          30;
        startFace       48800;
    }
    frontAndBackPlanes
    {
        type            empty;
        inGroups        1(empty);
        nFaces          48000;
        startFace       48830;
    }
)

// ************************************************************************* //
