0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 2509000;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }
    
    wall
    {
        type            zeroGradient;
    }

    axis
    {
        type            symmetry;
    }

    outlet
    {
        type            totalPressure;
        p0              uniform 2509000;
        
    }

    frontAndBackPlanes
    {
        type            empty;
    }
}

// ************************************************************************* //
