0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.0864;

boundaryField
{
    inlet
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.02;
        value           $internalField;
    }

    wall
    {
        type            kqRWallFunction;
        value           $internalField;
    }

    axis
    {
        type            symmetry;
    }

    outlet
    {
        type            zeroGradient;
    }

    frontAndBackPlanes
    {
         type            empty;
    }

    #includeEtc "caseDicts/setConstraintTypes"
}

// ************************************************************************* //
